{
	"id": "en",
	"brand": "BLOCKLY GAME",
	"last.updated": "Last updated",
	"navbar.about.game": "About game",
	"navbar.run.game": "Run game",
	"navbar.logout": "Log out",
	"login.heading": "Log in",
	"login.info": "You need to be logged in to run a game.",
	"register.heading": "Registration",
	"register.info": "Fill in all fields. After registration you will be automatically logged in.",
	"user.name": "User name",
	"password": "Password",
	"password.again": "Repeat the password",
	"remember": "Remember me",
	"login.button": "Log in",
	"register.button": "Register",
	"login.question": "Don't have an account yet?",
	"login.link": "Sign up now.",
	"register.question": "Already have an account?",
	"register.link": "Log in.",
	"validation.recaptcha": "Please confirm that you are not a robot.", 
	"game.button.send.code": "Run blocks",
	"game.button.stop.execution": "Stop execution",
	"game.button.show.task": "Assignment",
	"game.button.delete.blocks": "Clear all blocks",
	"game.button.report.bug": "Report bug",
	"game.command.failed.first": "Your first Blockly block is wrong:",
	"game.command.failed.second": "Your first Blockly block worked, but the following error occurred:",
	"game.command.failed.more": "A few of your Blockly blocks worked, but then an error occurred:",
	"game.command.failed.block": "The wrong block is colored red.",
	"carousel.1.title": "Blockly game.",
	"carousel.1.subtitle": "Your introduction to the world of programming.",
	"carousel.2.title": "10 levels.",
	"carousel.2.subtitle": "More than 40 tasks to solve.",
	"carousel.3.title": "Create algorithms.",
	"carousel.3.subtitle": "With commands in cycles and conditions.",
	"carousel.button.text": "Start playing!",
	"features.heading": "Game controlled by programming",
	"features.text": "Google Blockly introduces a visual editor of blocks that turn into code. After being sent to the game, it creates commands executed by the hero.",
	"features.1.heading": "Optimized for PC", 
	"features.1.text": "The game is not demanding on computer performance.", 
	"features.2.heading": "Player account",
	"features.2.text": "The progress of the player in the levels is automatically saved in the database.",
	"features.3.heading": "Time measurement",
	"features.3.text": "The duration of the task solution is recorded.",
	"features.4.heading": "Rating", 
	"features.4.text": "Level solutions are evaluated and the assignment must be followed.", 
	"features.5.heading": "PlayCanvas",
	"features.5.text": "The game section is built on the PlayCanvas web game engine.",
	"features.6.heading": "Web theme",
	"features.6.text": "New Age theme based on Bootstrap 4 was used for the website.",
	"gamelevels.category": "Category",
	"gamelevels.category.1": "In the first category, we learn to control the hero, give him commands to move, jump, sword attack, use the lever and open the chest.",
	"gamelevels.category.2": "In the second category we will learn to control the hero according to the new game system and we'll use cycles and conditions to create algorithms.",
	"gamelevels.level": "Level",
	"gamelevels.progress": "Progress",
	"gamelevels.start": "Start",
	"gamelevels.continue": "Continue",
	"gamelevels.start.button": "START FROM BEGINNING",
	"gamelevels.continue.button": "CONTINUE SAVED GAME",
	"gamelevels.button.info.lock": "Buttons Start from beginning and Continue saved game will unlock after completing all levels of the category.",
	"gamelevels.button.info.use": "To start the game use the green button ",
	"gamelevels.big.button.start": "Start a new game",
	"gamelevels.big.button.continue": "Continue game",
	"hero.info.heading": "Welcome to Blockly game!",
	"hero.info.text": "By combining the programming blocks in the game you will control the warrior hero. He came on an expedition to the old castle and in order to go through it, he must overcome many obstacles and accomplish many tasks. See the hero and the description of his abilities, which you will gradually acquire and use.",
	"hero.info.1.heading": "Jumps over obstacles",
	"hero.info.1.text": "When there is water or a trap set in the way, the hero can often skip them and move on.",
	"hero.info.2.heading": "Destroys things",
	"hero.info.2.text": "In the ruins of the castle are many old things such as boxes, barrels and vases that the hero's sword can destroy and clear the way.",
	"hero.info.3.heading": "Opens the chests",
	"hero.info.3.text": "Sometimes the hero needs to search the chests to find the key to the locked door.",
	"hero.info.4.heading": "Uses levers",
	"hero.info.4.text": "When you need to open a trap door or disarm traps, the hero uses the lever.", 
	"blocks.do.while.field": "repeat until hero is in target",
	"blocks.do.while.tooltip": "This block represents a doWhile cycle. All blocks inserted in this block will be repeated until the hero reaches the target of the specified task.",
	"blocks.for.field": "repeat x-times",
	"blocks.for.repeat": "repeat ",
	"blocks.for.times": "times",
	"blocks.for.tooltip": "This block represents a for loop. All blocks inserted in this block are executed sequentially exactly as many times as set.",
	"blocks.if.next.is.field": "if in the direction follows",
	"blocks.if.next.is.tooltip": "This block is a condition. All blocks inserted in this block are executed if in the direction of the hero follows the set type.",
	"blocks.if.next.has.field": "if next tile in direction has",
	"blocks.if.next.has.tooltip": "This block is a condition. All blocks inserted in this block are executed if what is set is present on the next tile in the direction of the hero.",
	"blocks.water": "water",
	"blocks.wall": "wall",
	"blocks.destructible": "destructible",
	"blocks.lever": "lever",
	"blocks.chest": "chest",
	"blocks.trap": "trap",
	"blocks.move.forward.field": "go 1 step in the direction",
	"blocks.move.forward.tooltip": "The hero moves one step in the current direction.",
	"blocks.rotate.left.field": "rotate the hero 90° to the left",
	"blocks.rotate.left.tooltip": "This block changes direction, the hero turns 90 degrees to the left.",
	"blocks.rotate.right.field": "rotate the hero 90° to the right",
	"blocks.rotate.right.tooltip": "This block changes direction, the hero turns 90 degrees to the right.",
	"blocks.move.field": "move by ",
	"blocks.move.right.tooltip": "The hero performs the number of set steps to the right.",
	"blocks.move.left.tooltip": "The hero performs the number of set steps to the left.",
	"blocks.move.down.tooltip": "The hero takes the number of set steps down.",
	"blocks.move.up.tooltip": "The hero takes the number of set steps up.", 
	"blocks.right": "right",
	"blocks.left": "left",
	"blocks.up": "up",
	"blocks.down": "down",
	"blocks.in.direction": "in direction",
	"blocks.attack.field": "attack",
	"blocks.attack.tooltip": "The hero attacks in the set direction. If there is a destructible thing in the direction, it will be destroyed.",
	"blocks.attack.forward.tooltip": "The hero attacks in the current direction. If there is a destructible thing in the direction, it will be destroyed.",
	"blocks.use.field": "use",
	"blocks.use.tooltip": "The hero uses the lever in the set direction.",
	"blocks.use.forward.tooltip": "The hero uses the lever in the current direction.",
	"blocks.open": "open",
	"blocks.open.tooltip": "The hero opens the chest in the set direction.",
	"blocks.open.forward.tooltip": "The hero opens the chest in the current direction.",
	"blocks.jump": "jump", 
	"blocks.jump.tooltip": "The hero jumps in the set direction.",
	"blocks.jump.forward": "jump forward in the direction",
	"blocks.jump.forward.tooltip": "The hero jumps in the current direction.",
	"blocks.player": "Hero  ", 
	"blocks.player.tooltip": "Basic block. When you click on this block or the Run Blocks button, the hero executes all the blocks located under this block.",
	"blocks.player.direction.tooltip": "Base block, shows the current direction of the hero, which can be changed by blocks of rotation. When you click on this block or the Run Blocks button, the hero executes all the blocks located under this block.",
	"blocks.run": "Run code",
	"blocks.camera.plus": "Zoom in",
	"blocks.camera.minus": "Zoom out",
	"blocks.load": "Load saved game",
	"blocks.save": "Save game",
	"blocks.reload": "Reload",
	"continue": "Continue",
	"try.again": "Try again",
	"restart.game": "Restart game",
	"next.level": "Next level",
	"close.window": "Close window",
	"modal.textarea.warning": "You can write",
	"modal.textarea.warning.2": "You can still write",
	"modal.textarea.characters": "characters",
	"modal.textarea.limit": "You have reached the maximum number of characters allowed.",
	"modal.textarea.label": "Bug description:",
	"send.bug": "Send bug report",
	"rating": "Rating",
	"time": "Time",
	"code": "Code",
	"rule.error": "Your solution was not accepted because you did not use the block:",
	"rule.error.count": "You need to use this block",
	"rule.error.times": "times",
	"rule.error.try.again": "Try again.",
	"languages": "Languages",
	
	"modals.dizzy.title": "Error!",
	"modals.dizzy.text": "The hero could not take a number of steps or jump because there was a wall, an obstacle or water in his path.",
	"modals.zerosteps.title": "Error!",
	"modals.zerosteps.text": "The hero cannot complete the specified number of steps.",
	"modals.death.title": "Error!",
	"modals.death.text": "The hero entered the trap.",
	"modals.functionerror.title": "Error!",
	"modals.functionerror.text": "Between the blocks there is a wrong condition or cycle. Put a command in them if they are empty, or reduce the number of repetitions or delete them.",
	"modals.maintaskfailed.title": "The main task was not completed",
	"modals.maintaskfailed.text": "The hero did not reach the finish. Modify the sequence of blocks to succeed. If you need help, click the Assignment button.",
	"modals.ajaxerror.title": "Communication with the server was interrupted",
	"modals.ajaxerror.text": "The game cannot continue because an error occurred while communicating with the server. You need to restart the game.",
	"modals.stoppedexecution.title": "The main task was not completed",
	"modals.stoppedexecution.text": "Command execution stopped.",

	"finish_modal.title":"All tasks completed!",
	"mainTask0.introduction_modal.title": "The first task assignment",
	"mainTask1.introduction_modal.title": "The second task assignment",
	"mainTask2.introduction_modal.title": "The third task assignment",
	"mainTask3.introduction_modal.title": "The fourth task assignment",
	"mainTask4.introduction_modal.title": "The fifth task assignment",
	"mainTask5.introduction_modal.title": "The sixth task assignment",
	"mainTask0.success_modal.title": "Well done! You've completed your first task!",
	"mainTask1.success_modal.title": "Well done! You've completed second task!",
	"mainTask2.success_modal.title": "Well done! You've completed third task!",
	"mainTask3.success_modal.title": "Well done! You've completed fourth task!",
	"mainTask4.success_modal.title": "Well done! You've completed fifth task!",
	"mainTask5.success_modal.title": "Well done! You've completed sixth task!",


	"1x1.welcome_modal.text":"In the first level, we will introduce the basis of control, which is movement. The hero can move in four directions. Select the block with the necessary direction of movement, attach it to the player block and set the number of steps. Then click Run Blocks. Your game character will then try to execute commands. All your tasks take time, so try to solve them as quickly as possible.",
	"1x1.finish_modal.text":"You have successfully learned to move with the hero. The next level will start now.",
	"1x1.mainTask0.introduction_modal.text": "Your hero needs to walk down the hall and get to the stone button in front of the iron door. Combine the required blocks and set the required number of steps to succeed.",
	"1x1.mainTask0.success_modal.text": "Your first algorithm allowed the hero to successfully reach the iron door. His journey can continue.",
	"1x1.mainTask1.introduction_modal.text": "A trapdoor was opened in front of the hero, followed by a short corridor that leads to another stone button behind the open door. Send your hero there using blocks.",
	"1x1.mainTask1.success_modal.text": "Your second algorithm allowed the hero to successfully reach the warehouse. Half the way at this level is already behind him.",
	"1x1.mainTask2.introduction_modal.text": "The hero is in a store full of things and he must move between them. Try to find the right way to the nearest stone button.",
	"1x1.mainTask2.success_modal.text": "Your third algorithm allowed the hero to successfully pass half the warehouse. The end of the level is already in sight.",
	"1x1.mainTask3.introduction_modal.text": "Complete level 1 and go with the hero to the last stone button, which is followed by stairs to the next level.",
	"1x1.mainTask3.success_modal.text": "The hero walked down the corridors and into the storehouse to the next level.",

	"1x2.welcome_modal.text":"In the second level the hero gains a new ability - jumping. He will need this ability to get through the flooded part of the castle.",
	"1x2.finish_modal.text":"You have successfully learned to jump with the hero. The next level will start now.",
	"1x2.mainTask0.introduction_modal.text": "Your hero needs to jump over places flooded with water to get to the nearest stone button on the right. Connect blocks of movement and jump so that he succeeds.",
	"1x2.mainTask0.success_modal.text": "Your first algorithm at this level allowed the hero to jump over the flooded parts.",
	"1x2.mainTask1.introduction_modal.text": "The journey on this shore is no longer on and so the hero has to go again through the water, this time to the island on the left. Connect blocks of movement and jump so that the hero comes to the stone button near the wall with fire.",
	"1x2.mainTask1.success_modal.text": "The hero has arrived at the target thanks to the correct algorithm.",
	"1x2.mainTask2.introduction_modal.text": "In this task, the hero just needs to go and jump in one direction to get to the right side of the remote stone button.",
	"1x2.mainTask2.success_modal.text": "The hero has successfully overcome the flooded part of the level and is approaching the final destination.",
	"1x2.mainTask3.introduction_modal.text": "The hero no longer has to jump over the water, but now he has a dangerous obstacle ahead - activated traps. Avoid them and get to the stone button at the stairway to the next level.",
	"1x2.mainTask3.success_modal.text": "It seems that using jump does not make you the slightest problem. You made it through the water and traps.",

	"1x3.welcome_modal.text":"In the third level, the hero gains a new ability - sword attack. He will need this ability to get through various obstacles in the way, such as boxes or barrels.",
	"1x3.finish_modal.text":"You have successfully learned to destroy obstacles with the hero. The next level will start now.",
	"1x3.mainTask0.introduction_modal.text": "The way to the first stone button is blocked by several boxes. Use an attack block with a movement block to get through them.",
	"1x3.mainTask0.success_modal.text": "Your first algorithm in this level allowed the hero to chop the boxes in the path.",
	"1x3.mainTask1.introduction_modal.text": "In this task, the hero is facing barrels instead of pots, but they have no chance against his sword. It is also necessary to use jumping and avoid the trap in front of the stone button.",
	"1x3.mainTask1.success_modal.text": "Your second algorithm allowed the hero to chop the barrels in his way and successfully reach the target.",
	"1x3.mainTask2.introduction_modal.text": "And in the third task, hero will face old empty vases to destroy them as well. Let's do this.",
	"1x3.mainTask2.success_modal.text": "It looks like nothing can stop your hero. Keep up the good work.",
	"1x3.mainTask3.introduction_modal.text": "In the next fourth role of the heroes, the procedure will be more about jumping than cutting with a sword. Can you find the right blocks to bring the hero to the stone button?",
	"1x3.mainTask3.success_modal.text": "Great job, the end of the level is already within hero's reach.",
	"1x3.mainTask4.introduction_modal.text": "There is only one stone button that the hero must reach. In his path is only the last vase and many dangerously spaced traps to watch out for.",
	"1x3.mainTask4.success_modal.text": "You have proven that you can handle the sword as well as jumping.",

	"1x4.welcome_modal.text":"In the fourth level, the hero gains a new ability - using the lever. He would need this ability to deactivate the traps in the road and to open the door.",
	"1x4.finish_modal.text":"You have successfully learned the ability to use a lever with a hero. The next level will start now.",
	"1x4.mainTask0.introduction_modal.text": "The road to the first stone button is blocked by several barrels and closed doors. Destroy the barrels and use the lever.",
	"1x4.mainTask0.success_modal.text": "Your first algorithm at this level allowed the hero to chop the barrels standing in the path and open the door using the lever.",
	"1x4.mainTask1.introduction_modal.text": "In this role the hero awaits a longer journey, which includes jumping, destroying boxes and circumventing traps.",
	"1x4.mainTask1.success_modal.text": "Well done! Your second algorithm allowed the hero to successfully reach the target and overcome all obstacles.",
	"1x4.mainTask2.introduction_modal.text": "The hero's path is blocked by two successive traps that cannot be avoided. Fortunately, the levers to turn them off are nearby, use them.",
	"1x4.mainTask2.success_modal.text": "In your third algorithm, you used both levers and so the hero successfully overcomes a dangerous obstacle.",
	"1x4.mainTask3.introduction_modal.text": "And this is the last task of this level, in which the door must be opened again. Open with the lever behind the vase.",
	"1x4.mainTask3.success_modal.text": "You have proven that using the lever is as easy for you as jumping and sword swinging.",

	"1x5.welcome_modal.text":"In the fifth level of hero gains and new ability - opening the chest. He will need this ability to open the door with the key he takes from the chest.",
	"1x5.finish_modal.text":"You have successfully learned the ability to open a hero's chest, as well as movement, jumping, sword attack and lever use. This was the final level.",
	"1x5.mainTask0.introduction_modal.text": "The road to the first stone button is blocked by water, boxes, traps and closed trapdoors. Overcome obstacles and open the door.",
	"1x5.mainTask0.success_modal.text": "Your first algorithm at this level allowed the hero to reach the chest room.",
	"1x5.mainTask1.introduction_modal.text": "To get the hero further, he must get the key from the chest to open the locked door. Use the chest opening block and then bring the hero to the stone button in the front of the door.",
	"1x5.mainTask1.success_modal.text": "You have successfully found the key and opened the door. The hero can continue his journey.",
	"1x5.mainTask2.introduction_modal.text": "In this task we have a stone button behind the closed door, in the front of which the trap is activated. Use the levers to get over obstacles.",
	"1x5.mainTask2.success_modal.text": "You used both levers in your third algorithm to successfully overcome a dangerous obstacle.",
	"1x5.mainTask3.introduction_modal.text": "There is one way to the stone button to accomplish this task, but is blocked by a trap that cannot be avoided. Turn it off with the lever.",
	"1x5.mainTask3.success_modal.text": "Well done, your hero already has a target within reach.",
	"1x5.mainTask4.introduction_modal.text": "In the last task of level five, use the trap release lever and skip the flooded section.",
	"1x5.mainTask4.success_modal.text": "Obviously, you already know how to use the obstacle removal lever.",

	"2x1.welcome_modal.text":"The second game category begins and the game control system changes. From now on, you will not select the block with the correct direction or set the direction eg. while jumping. The hero's direction will already be set, shown by the yellow arrow on the player's block. To change it, you must rotate the hero using two dedicated blocks before the hero executes other commands.",
	"2x1.finish_modal.text": "You have successfully learned the basics of mastering the hero according to the new rules.",
	"2x1.mainTask0.introduction_modal.text": "In the first task, all you need is one-step motion and rotation blocks. At the beginning of the level, the hero is directed to the right, turning left counterclockwise will point him up, turning right will direct him down. Rotate it correctly and jump up to the stone button.",
	"2x1.mainTask0.success_modal.text": "Your first algorithm uses the new control system well, allowing the hero to jump to the first stone button.",
	"2x1.mainTask1.introduction_modal.text": "Now the target is a bit further and there are several obstacles in the way. Destroy the barrel and avoid traps, but especially make sure that the hero always turns when necessary.",
	"2x1.mainTask1.success_modal.text": "You have successfully avoided all obstacles. The hero can continue his journey.",
	"2x1.mainTask2.introduction_modal.text": "In this task, a lever must be used to dispose of an activated trap that cannot be avoided.",
	"2x1.mainTask2.success_modal.text": "You used a lever in your third algorithm so the hero could overcome a dangerous obstacle.",
	"2x1.mainTask3.introduction_modal.text": "Now there's a more complicated road to the stone button with vases standing in the road that need to be destroyed.",
	"2x1.mainTask3.success_modal.text": "Well done, your hero has a target within reach.",

	"2x2.welcome_modal.text":"In the second level of the second hero category you get a new block - repeat x times. This is a for loop that executes all the blocks you attach to it as many times as you set. This is useful if you need to perform a sequence of blocks several times in a row to complete the task.",
	"2x2.finish_modal.text": "You have successfully learned to work with a for loop.",
	"2x2.mainTask0.introduction_modal.text": "In the first task, all you need is one-step motion and rotation blocks. Place them in the block repeated x times and set the correct number of repetitions. In the beginning, the hero is directed to the right.",
	"2x2.mainTask0.success_modal.text": "In your first algorithm, you correctly used and set up the for loop to allow the hero to go to the first stone button.",
	"2x2.mainTask1.introduction_modal.text": "Now the hero needs to jump over the water. This can be greatly optimized using the repeat block x times, and two such blocks must be used to accomplish this task. Start by directing the hero up, and then use the repeating blocks so that the second is inside the first.",
	"2x2.mainTask1.success_modal.text": "You've mastered a nested for loop, and the hero can continue on his way.",
	"2x2.mainTask2.introduction_modal.text": "In this task we have a stone button behind closed doors that are locked with a key that we have to find in the chest. So the hero needs to open all the chests. Use the repeat block x times, move the block and rotate clockwise.",
	"2x2.mainTask2.success_modal.text": "In your third algorithm you opened 6 chests, the hero found the key and got through the closed door.",
	"2x2.mainTask3.introduction_modal.text": "The way to the stone button to accomplish this task is blocked by vases that need to be destroyed. Once again, use the repeat block x times.",
	"2x2.mainTask3.success_modal.text": "It doesn't seem to be a problem to optimize your algorithms with a for loop. One more task and you're going to finish this level.",
	"2x2.mainTask4.introduction_modal.text": "And to complete the level, just use two levers to defeat the traps blocking access to the target. In the beginning, point the hero down and use the repeat block x twice.",
	"2x2.mainTask4.success_modal.text": "Well done, your hero already has a target within reach.",

	"2x3.welcome_modal.text":"In the third level you get a new block - repeat until the hero is in the target. This block, which is a doWhile cycle, works similar to the repeat block x times, except that you don't have to set the number of repetitions. Therefore, all blocks in it will be repeated sequentially until the task is completed or an error occurs while performing action of some block.",
	"2x3.finish_modal.text": "You have successfully learned to use the repeat until the hero is at the target block.",
	"2x3.mainTask0.introduction_modal.text": "The way to the first stone button is straight and without any obstacles. Use the new block.",
	"2x3.mainTask0.success_modal.text": "The doWhile cycle is simple and runs great. Let's see how it goes on more complex tasks.",
	"2x3.mainTask1.introduction_modal.text": "In order for the hero to go further, you must use a repeat block in addition to the new block.",
	"2x3.mainTask1.success_modal.text": "You have successfully combined two cycles. The hero can continue his journey.",
	"2x3.mainTask2.introduction_modal.text": "In this task, the stone button hero must reach by jumping. You do not need to use the block repeat again x times.",
	"2x3.mainTask2.success_modal.text": "It seems that using the doWhile cycle is not a problem for you.",
	"2x3.mainTask3.introduction_modal.text": "Getting to the next stone button is harder this time, one of the blocks has a trap. Turn it off with the lever. Also, use the repeat block x times that you put inside.",
	"2x3.mainTask3.success_modal.text": "Well done, your hero already has a target within reach.",
	"2x3.mainTask4.introduction_modal.text": "In the last task of this level, use both cycles again - with the for loop inside the doWhile loop. Turn the hero once to the right before using the doWhile cycle.",
	"2x3.mainTask4.success_modal.text": "Obviously, you can master both cycles perfectly.",

	"2x4.welcome_modal.text":"In the fourth level you get up to two new blocks - a block if it follows in the direction and a block if it is in the direction of the tile. These blocks act as if conditions, so other blocks inserted in them are executed only if the specified condition is met. This allows us to execute various commands depending on where the hero is.",
	"2x4.finish_modal.text": "You have successfully learned to use the conditions. The final level of the game starts now.",
	"2x4.mainTask0.introduction_modal.text": "The road to the first stone button is not blocked by any obstacles, but the hero must always turn in the right place. Use the block repeat until the hero is in the target and twice the block if it follows in the direction.",
	"2x4.mainTask0.success_modal.text": "Your first condition algorithm worked well and the hero arrived at the stone button.",
	"2x4.mainTask1.introduction_modal.text": "In order to get further, the hero must use every lever in the way to defeat the traps and open the trapdoor. Use the Repeat block until the hero is in the target, the block if it follows in the direction and the block if it is in the direction of the tile.",
	"2x4.mainTask1.success_modal.text": "You have successfully eliminated the traps and opened the door. The hero can continue his journey.",
	"2x4.mainTask2.introduction_modal.text": "In this task, there are vases in the hero's path that need to be destroyed and at the same time the hero needs to change direction when there is water or a wall in front of him. At the beginning, turn the hero once to the right and then use the repeat block until the hero is in the target, the block if in the direction following, and the block if in the direction of the tile.",
	"2x4.mainTask2.success_modal.text": "In your third algorithm, you used both conditions exactly as specified.",
	"2x4.mainTask3.introduction_modal.text": "There is a short path to the stone button to complete this level, but there are traps and water to avoid. First point the hero to the right and then use the repeat block until the hero is in the target, the block if in the direction and the block in the direction of the tile.",
	"2x4.mainTask3.success_modal.text": "Well done, your hero got to the finish.",

	"2x5.welcome_modal.text":"In the fifth level you will not find a new block - but we will repeat what was the main topic of the second category and thus working with cycles and conditions.",
	"2x5.finish_modal.text": "Congratulations! You've successfully learned the basics of creating algorithms using Google Blockly.",
	"2x5.mainTask0.introduction_modal.text": "To the stone button the hero must get through the water and destroy the barrel. Use only the block repeart until the hero is at the target and solve the task without using conditions.",
	"2x5.mainTask0.success_modal.text": "It seems that using the doWhile cycle is really going well.",
	"2x5.mainTask1.introduction_modal.text": "To get further, the hero must open all the chests to find the door key while using all the levers to defeat the traps in the way. Use the block repeat until hero is in the target in which there will be block if it follows in the direction twice, followed by the block repeat x times, which will include a chest condition and a lever condition.",
	"2x5.mainTask1.success_modal.text": "Your algorithm allowed the hero to search all the chests, use the levers to deactivate the trap, and get through the door. The hero can continue his journey.",
	"2x5.mainTask2.introduction_modal.text": "In this task, we have a stone button a little further and there are traps to avoid. At the beginning, turn the hero once to the left and then use the repeat block until the hero is in the target, twice the block if it follows in the direction and once the block if it is in the direction of the tile.",
	"2x5.mainTask2.success_modal.text": "You used both conditions in your third algorithm, so the hero successfully reached the stone button.",
	"2x5.mainTask3.introduction_modal.text": "Finally, the hero needs to destroy the vases and use the lever to open the trapdoor so he can come to the last stone button in this game. Use the repeat block until the hero is in the target, once block if in the direction follows and twice block if in the direction on the tile.",
	"2x5.mainTask3.success_modal.text": "The last role in the game has just been accomplished.",

	"footer.heading.links": "Links",
	"footer.heading.latest.updates": "Latest updates",
	"footer.heading.technologies": "Technologies",

	"footer.links.0": "GitHub Repository",
	"footer.links.1": "PlayCanvas",
	"footer.links.2": "Google Blockly",
	"footer.links.3": "Hosted on Microsoft Azure",

	"footer.latestupdates.0.title": "Azure deployment patch",
	"footer.latestupdates.0.date": "15.5.2020",
	"footer.latestupdates.0.text": "Brings Google ReCaptcha and enables HTTPS, fixes remember-me login, introduces new scroll bar and new footer redesign.",

	"footer.latestupdates.1.title": "Azure deployment",
	"footer.latestupdates.1.date": "14.5.2020",
	"footer.latestupdates.1.text": "Blockly Game is now hosted on Microsoft Azure.",

	"footer.latestupdates.2.title": "Localization",
	"footer.latestupdates.2.date": "13.5.2020",
	"footer.latestupdates.2.text": "Blockly Game now uses IP-API to determine user's country code and then set language accordingly."
  }