{
 "id": "sk",
 "brand": "BLOCKLY HRA",
 "last.updated": "Naposledy aktualizované",
 "navbar.about.game": "O hre",
 "navbar.run.game": "Spustiť hru",
 "navbar.logout": "Odhlásiť sa",
 "login.heading": "Prihlásenie",
 "login.info": "Pre spustenie hry je potrebné byť prihlásený.",
 "register.heading": "Registrácia",
 "register.info": "Vyplňte všetky polia. Po registrácii budete automaticky prihlásení.",
 "user.name": "Prihlasovacie meno",
 "password": "Heslo",
 "password.again": "Zopakujte heslo",
 "remember": "Zapamätať",
 "login.button": "Prihlásiť sa",
 "register.button": "Zaregistrovať sa",
 "login.question": "Nemáte ešte účet?",
 "login.link": "Zaregistrujte sa.",
 "register.question": "Máte už účet?",
 "register.link": "Prihláste sa.",
 "validation.recaptcha": "Prosím potvrďte, že nie ste robot.", 
 "game.button.send.code": "Spustiť bloky",
 "game.button.stop.execution": "Zastaviť vykonávanie",
 "game.button.show.task": "Zadanie úlohy",
 "game.button.delete.blocks": "Vymazať všetky bloky",
 "game.button.report.bug": "Nahlásiť chybu",
 "game.command.failed.first": "Váš prvý Blockly blok je chybný:",
 "game.command.failed.second": "Váš prvý Blockly blok fungoval, ale v nasledujúcom nastala chyba:",
 "game.command.failed.more": "Niekoľko vašich Blockly blokov fungovalo, ale potom nastala chyba:",
 "game.command.failed.block": "Chybný blok je zafarbený na červeno.",
 "carousel.1.title": "Blockly hra.",
 "carousel.1.subtitle": "Váš úvod do sveta programovania.",
 "carousel.2.title": "10 úrovní.",
 "carousel.2.subtitle": "Viac ako 40 úloh na riešenie.",
 "carousel.3.title": "Tvorte algoritmy.",
 "carousel.3.subtitle": "S príkazmi v cykloch a podmienkach.",
 "carousel.button.text": "Začnite hrať!",
 "features.heading": "Hra ovládaná programovaním",
 "features.text": "Google Blockly prináša vizuálny editor blokov, ktoré sa premieňajú na kód. Po odoslaní do hry z neho vznikajú príkazy vykonávané hrdinom.",
 "features.1.heading": "Optimalizované pre PC", 
 "features.1.text": "Hra nie je náročná na výkon počítača.", 
 "features.2.heading": "Účet hráča",
 "features.2.text": "Postup hráča v úrovniach sa automaticky ukladá do databázy.",
 "features.3.heading": "Meranie času",
 "features.3.text": "Dĺžka trvania riešenia úloh je zaznamenávaná.",
 "features.4.heading": "Hodnotenie", 
 "features.4.text": "Riešenia úrovní sú hodnotené a je nutné dodržiavať zadanie.", 
 "features.5.heading": "PlayCanvas",
 "features.5.text": "Herná časť je postavená na webovom hernom engine PlayCanvas.",
 "features.6.heading": "Webová téma",
 "features.6.text": "Pre webovú stránku bola použitá téma New Age založená na Bootstrap 4.",
 "gamelevels.category": "Kategória",
 "gamelevels.category.1": "V prvej kategórii sa naučíme ovládať hrdinu, zadávať mu príkazy pohyb, skok, útok mečom, použitie páky a otvorenie truhlice.",
 "gamelevels.category.2": "V druhej kategórii sa naučíme ovládať hrdinu podľa nového herného systému a využívať pri tvorbe algoritmov cykly a podmienky.",
 "gamelevels.level": "Úroveň",
 "gamelevels.progress": "Postup",
 "gamelevels.start": "Spustiť",
 "gamelevels.continue": "Pokračovať",
 "gamelevels.start.button": "SPUSTIŤ OD ZAČIATKU",
 "gamelevels.continue.button": "POKRAČOVAŤ V ULOŽENEJ HRE",
 "gamelevels.button.info.lock": "Tlačidlá Spustiť od začiatku a Pokračovať v uloženej hre sa odomknú po dokončení všetkých úrovní kategórie.",
 "gamelevels.button.info.use": "Na spustenie hry používajte zelené tlačidlo",
 "gamelevels.big.button.start": "Začať novú hru",
 "gamelevels.big.button.continue": "Pokračovať v hre",
 "hero.info.heading": "Vitajte v Blockly hre!",
 "hero.info.text": "Pomocou spájania programovacích blokov v nej budete ovládať hrdinu bojovníka. Ten prišiel na výpravu do starého hradu a aby ho prešiel celý, musí prekonať množstvo prekážok a splniť mnoho úloh. Prezrite si hrdinu a popis jeho schopností, ktoré postupne získa a budete používať.",
 "hero.info.1.heading": "Preskočí prekážky",
 "hero.info.1.text": "Keď je v ceste voda alebo nastražená pasca, hrdina ich často dokáže preskočiť a pokračovať ďalej.",
 "hero.info.2.heading": "Zničí veci",
 "hero.info.2.text": "V ruinách hradu sa nachádza veľa starých vecí ako sú krabice, sudy a vázy, ktoré hrdinov meč dokáže zničiť a uvoľniť cestu.",
 "hero.info.3.heading": "Otvára truhlice",
 "hero.info.3.text": "Niekedy hrdina potrebuje prehľadať truhlice, aby našiel kľúč od zamknutých dverí.",
 "hero.info.4.heading": "Používa páky",
 "hero.info.4.text": "Keď treba otvoriť padacie dvere alebo zneškodniť pasce, hrdina použije páku.",
 "blocks.do.while.field": "opakuj pokiaľ nie je hrdina v cieli",
 "blocks.do.while.tooltip": "Tento blok predstavuje cyklus typu doWhile. Všetky bloky vložené do tohto bloku sa budú opakovať, kým sa hrdina nedostane do cieľa zadanej úlohy.",
 "blocks.for.field": "opakuj x-krát",
 "blocks.for.repeat": "opakuj ",
 "blocks.for.times": "krát",
 "blocks.for.tooltip": "Tento blok predstavuje cyklus typu for. Všetky bloky vložené do tohto bloku sa postupne vykonajú presne toľko krát, ako je nastavené.",
 "blocks.if.next.is.field": "ak v smere nasleduje",
 "blocks.if.next.is.tooltip": "Tento blok predstavuje podmienku. Všetky bloky vložené do tohto bloku sa vykonajú, ak v smere hrdinu nasleduje to, čo je nastavené.",
 "blocks.if.next.has.field": "ak v smere na dlaždici je",
 "blocks.if.next.has.tooltip": "Tento blok predstavuje podmienku. Všetky bloky vložené do tohto bloku sa vykonajú, ak sa v smere hrdinu na nasledujúcej dlaždici nachádza to, čo je nastavené.",
 "blocks.water": "voda",
 "blocks.wall": "stena",
 "blocks.destructible": "zničiteľná vec",
 "blocks.lever": "páka",
 "blocks.chest": "truhlica",
 "blocks.trap": "pasca",
 "blocks.move.forward.field": "choď o 1 krok v smere",
 "blocks.move.forward.tooltip": "Hrdina sa presunie o jeden krok v aktuálnom smere.",
 "blocks.rotate.left.field": "otočiť hrdinu o 90° doľava",
 "blocks.rotate.left.tooltip": "Tento blok mení smer, hrdina sa otočí o 90 stupňov doľava.",
 "blocks.rotate.right.field": "otočiť hrdinu o 90° doprava",
 "blocks.rotate.right.tooltip": "Tento blok mení smer, hrdina sa otočí o 90 stupňov doprava.",
 "blocks.move.field": "choď o",
 "blocks.move.right.tooltip": "Hrdina vykoná smerom doprava počet nastavených krokov.",
 "blocks.move.left.tooltip": "Hrdina vykoná smerom doľava počet nastavených krokov.",
 "blocks.move.down.tooltip": "Hrdina vykoná smerom dole počet nastavených krokov.",
 "blocks.move.up.tooltip": "Hrdina vykoná smerom hore počet nastavených krokov.", 
 "blocks.right": "doprava",
 "blocks.left": "doľava",
 "blocks.up": "hore",
 "blocks.down": "dole",
 "blocks.in.direction": "v smere",
 "blocks.attack.field": "zaútoč",
 "blocks.attack.tooltip": "Hrdina záutočí v nastavenom smere. Ak sa v smere nachádza zničiteľná vec, bude zničená.",
 "blocks.attack.forward.tooltip": "Hrdina záutočí v aktuálnom smere. Ak sa v smere nachádza zničiteľná vec, bude zničená.",
 "blocks.use.field": "použi",
 "blocks.use.tooltip": "Hrdina použije páku v nastavenom smere.",
 "blocks.use.forward.tooltip": "Hrdina použije páku v nastavenom smere.",
 "blocks.open": "otvor",
 "blocks.open.tooltip": "Hrdina otvorí truhlicu v nastavenom smere.",
 "blocks.open.forward.tooltip": "Hrdina otvorí truhlicu v aktuálnom smere.",
 "blocks.jump": "skoč", 
 "blocks.jump.tooltip": "Hrdina skočí v nastavenom smere.",
 "blocks.jump.forward": "skoč dopredu v smere",
 "blocks.jump.forward.tooltip": "Hrdina skočí v aktuálnom smere.",
 "blocks.player": "Hrdina  ", 
 "blocks.player.tooltip": "Základný blok. Po kliknutí na tento blok alebo na tlačidlo Spustiť bloky hrdina vykonáva všetky bloky umiestnené pod týmto blokom.",
 "blocks.player.direction.tooltip": "Základný blok, zobrazuje aktuálny smer hrdinu, ktorý sa dať meniť blokmi s otáčaním. Po kliknutí na tento blok alebo na tlačidlo Spustiť bloky hrdina vykonáva všetky bloky umiestnené pod týmto blokom.",
 "blocks.run": "Spustiť kód",
 "blocks.camera.plus": "Priblížiť",
 "blocks.camera.minus": "Oddialiť",
 "blocks.load": "Načítať uloženú hru",
 "blocks.save": "Uložiť hru",
 "blocks.reload": "Znovu načítať",
 "continue": "Pokračovať",
 "try.again": "Skúsiť znova",
 "restart.game": "Reštarovať hru",
 "next.level": "Ďalšia úroveň",
 "close.window": "Zavrieť okno",
 "modal.textarea.warning": "Môžete napísať",
 "modal.textarea.warning.2": "Ešte môžete napísať",
 "modal.textarea.characters": "znakov",
 "modal.textarea.limit": "Dosiahli ste maximum povolených znakov.",
 "modal.textarea.label": "Popis chyby:",
 "send.bug": "Odoslať chybu",
 "rating": "Hodnotenie",
 "time": "Čas",
 "code": "Kód",
 "rule.error": "Vaše riešenie nebolo uznané, pretože ste nepoužili blok:",
 "rule.error.count": "Tento blok treba použiť",
 "rule.error.times": "krát",
 "rule.error.try.again": "Skúste to znova.",
 "languages": "Jazyky",

 "modals.dizzy.title": "Chyba!",
 "modals.dizzy.text": "Hrdina nemohol vykonať počet krokov alebo skok, pretože v jeho ceste bola stena, prekážka alebo voda.",
 "modals.zerosteps.title": "Chyba!",
 "modals.zerosteps.text": "Hrdina nedokáže vykonať zadaný počet krokov.",
 "modals.death.title": "Chyba!",
 "modals.death.text": "Hrdina vošiel do nastraženej pasce.",
 "modals.functionerror.title": "Chyba!",
 "modals.functionerror.text": "Medzi blokmi sa nachádza chybne nastavená podmienka alebo chybný cyklus. Vložte do nich nejaký príkaz ak sú prázdne, prípadne znížte počet opakovaní alebo ich odstráňte.",
 "modals.maintaskfailed.title": "Hlavná úloha nebola splnená",
 "modals.maintaskfailed.text": "Hrdina nedorazil do cieľa. Uprav sekvenciu blokov tak, aby sa mu to podarilo. Ak potrebujete nápovedu, kliknite na tlačidlo Zadanie úlohy.",
 "modals.ajaxerror.title": "Komunikácia so serverom bola prerušená",
 "modals.ajaxerror.text": "Hra nemôže ďalej pokračovať, lebo pri komunikácii so serverom došlo ku chybe. Je potrebné spustiť hru znova.",
 "modals.stoppedexecution.title": "Hlavná úloha nebola splnená",
 "modals.stoppedexecution.text": "Vykonávanie príkazov bolo zastavené.",

 "finish_modal.title":"Všetky úlohy boli splnené!",
 "mainTask0.introduction_modal.title": "Zadanie prvej úlohy",
 "mainTask1.introduction_modal.title": "Zadanie druhej úlohy",
 "mainTask2.introduction_modal.title": "Zadanie tretej úlohy",
 "mainTask3.introduction_modal.title": "Zadanie štvrtej úlohy",
 "mainTask4.introduction_modal.title": "Zadanie piatej úlohy",
 "mainTask5.introduction_modal.title": "Zadanie šiestej úlohy",
 "mainTask0.success_modal.title": "Výborne! Splnili ste prvú úlohu!",
 "mainTask1.success_modal.title": "Výborne! Splnili ste druhú úlohu!",
 "mainTask2.success_modal.title": "Výborne! Splnili ste tretiu úlohu!",
 "mainTask3.success_modal.title": "Výborne! Splnili ste štvrtú úlohu!",
 "mainTask4.success_modal.title": "Výborne! Splnili ste piatu úlohu!",
 "mainTask5.success_modal.title": "Výborne! Splnili ste šiestu úlohu!",

 "1x1.welcome_modal.text":"V prvej úrovni si predstavíme základ ovládania, ktorým je pohyb. Hrdina sa dokáže pohybovať v štyroch smeroch. Vyberte blok s potrebným smerom pohybu, pripojte ho k bloku hráča a  nastavte počet krokov. Potom kliknite na tlačidlo Spustiť bloky. Vaša herná postava sa potom pokúsi výkonať príkazy. Pri všetkých úlohách sa vám meria čas, takže sa ich snažte riešiť čo najrýchlejšie.",
 "1x1.finish_modal.text": "Úspešne ste sa naučili pohybovať s hrdinom. Nasleduje ďalšia úroveň.",
 "1x1.mainTask0.introduction_modal.text": "Váš hrdina potrebuje prejsť chodbou a dostať sa až na kamenné tlačidlo pred železnými dverami. Spojte vyžadované bloky a nastavte im potrebný počet krokov, aby sa mu to podarilo.",
 "1x1.mainTask0.success_modal.text": "Váš prvý algoritmus umožnil hrdinovi úspešne doraziť ku železným dverám. Jeho cesta môže pokračovať ďalej.",
 "1x1.mainTask1.introduction_modal.text": "Pred hrdinom sa otvorili padacie dvere a nasleduje krátka chodba, ktorá vedie k ďalšiemu kamennému tlačidlu za otvorenými dverami. Pošlite tam vášho hrdinu pomocou blokov.",
 "1x1.mainTask1.success_modal.text": "Váš druhý algoritmus umožnil hrdinovi úspešne doraziť do skladu. Polovica cesty v tejto úrovni je už za ním.",
 "1x1.mainTask2.introduction_modal.text": "Hrdina sa nachádza v sklade plnom vecí, medzi ktorými sa musí pohybovať. Skúste nájsť správnu cestu k najbližšiemu kamennému tlačidlu.",
 "1x1.mainTask2.success_modal.text": "Váš tretí algoritmus umožnil hrdinovi úspešne prejsť polovicu skladu. Koniec úrovne je už na dohľad.",
 "1x1.mainTask3.introduction_modal.text": "Dokončite úroveň 1 a prejdite s hrdinom k poslednému kamennému tlačidlu, za ktorým už sú schody do ďalšej úrovne.",
 "1x1.mainTask3.success_modal.text": "Hrdina prešiel chodbami a skladom až ku schodom do ďalšej úrovne.",

 "1x2.welcome_modal.text":"V druhej úrovni hrdina získava novú schopnosť - skákanie. Túto schopnosť bude potrebovať, aby sa mohol dostať cez zatopenú časť hradu.",
 "1x2.finish_modal.text": "Úspešne ste sa naučili skákať s hrdinom. Nasleduje ďalšia úroveň.",
 "1x2.mainTask0.introduction_modal.text": "Váš hrdina potrebuje preskočiť miesta zatopené vodou, aby sa dostal na najbližšie kamenné tlačidlo v pravej časti. Spojte bloky pohybu a skoku tak, aby sa mu to podarilo.",
 "1x2.mainTask0.success_modal.text": "Váš prvý algoritmus v tejto úrovni umožnil hrdinovi preskočiť zatopené časti.",
 "1x2.mainTask1.introduction_modal.text": "Cesta na tomto brehu ďalej nepokračuje a tak sa hrdina opäť musí vydať cez vodu, tentokrát na ostrov v ľavej časti. Spojte bloky pohybu a skoku tak, aby hrdina prišiel na kamenné tlačidlo pri stene s ohňom.",
 "1x2.mainTask1.success_modal.text": "Hrdina dorazil do cieľa vďaka správnemu algoritmu.",
 "1x2.mainTask2.introduction_modal.text": "V tejto úlohe hrdinovi stačí ísť a skákať jedným smerom, aby sa dostal na pravú stranu ku vzdialenému kamennému tlačidlu.",
 "1x2.mainTask2.success_modal.text": "Hrdina úspešne prekonal zatopenú časť úrovne a blíži sa do cieľa.",
 "1x2.mainTask3.introduction_modal.text": "Hrdina už nemusí skákať cez vodu, no teraz má pred sebou nebezpečnú prekážku - aktivované pasce. Vyhnite sa im a dostaňte sa na kamenné tlačidlo pri schodisku do ďalšej úrovne.",
 "1x2.mainTask3.success_modal.text": "Zdá sa, že vám používanie skoku nerobí najmenší problém. Zvládli ste cestu cez vodu a pasce.",

 "1x3.welcome_modal.text":"V tretej úrovni hrdina získava novú schopnosť - útok mečom. Túto schopnosť bude potrebovať, aby sa mohol dostať cez rôzne prekážky v ceste ako sú krabice či sudy.",
 "1x3.finish_modal.text": "Úspešne ste sa naučili ničiť prekážky s hrdinom. Nasleduje ďalšia úroveň.",
 "1x3.mainTask0.introduction_modal.text": "Cestu k prvému kamennému tlačidlu blokuje niekoľko krabíc. Použite blok útoku spolu s blokom pohybu, aby ste sa cez ne dostali.",
 "1x3.mainTask0.success_modal.text": "Váš prvý algoritmus v tejto úrovni umožnil hrdinovi rozsekať krabice stojace v ceste.",
 "1x3.mainTask1.introduction_modal.text": "V tejto úlohe proti hrdinovi stoja sudy namiesto kabíc, avšak proti jeho meču nemajú šancu. Je potrebné už aj použiť skákanie a vyhnúť sa pasci pred kamenným tlačidlom.",
 "1x3.mainTask1.success_modal.text": "Váš druhý algoritmus umožnil hrdinovi rozsekať sudy stojace v ceste a úspešne dosiahnuť cieľ.",
 "1x3.mainTask2.introduction_modal.text": "A do tretice hrdinu čakajú staré prázdne vázy, zničiť však pôjdu rovnako. Tak poďme na to.",
 "1x3.mainTask2.success_modal.text": "Vyzerá to tak, že vášho hrdinu nemôže nič zastaviť. Len tak ďalej.",
 "1x3.mainTask3.introduction_modal.text": "V nasledujúcej štvrtej úlohe hrdinov postup bude skôr o skákaní ako o sekaní mečom. Dokážete nájsť správne bloky, ktoré privedú hrdinu ku kamennému tlačidlu?",
 "1x3.mainTask3.success_modal.text": "Skvelá práca, koniec úrovne už má hrdina na dosah.",
 "1x3.mainTask4.introduction_modal.text": "Ostáva už len jedno kamenné tlačidlo, na ktoré sa hrdina musí dostať. V ceste mu stojí už len posledná váza a mnoho nebezpečne rozmiestnených pascí, na ktoré si dajte pozor.",
 "1x3.mainTask4.success_modal.text": "Dokázali ste, že sekanie mečom vám ide tak dobre, ako skákanie.",

 "1x4.welcome_modal.text":"Vo štvrtej úrovni hrdina získava novú schopnosť - použitie páky. Túto schopnosť bude potrebovať, aby mohol deaktivovať pasce ohrozujúce ho v ceste a aby mohol otvárať dvere.",
 "1x4.finish_modal.text": "Úspešne ste sa naučili schopnosť používať páku s hrdinom. Nasleduje ďalšia úroveň.",
 "1x4.mainTask0.introduction_modal.text": "Cestu k prvému kamennému tlačidlu blokuje niekoľko sudov a zatvorené dvere. Zničte sudy a použite páku.",
 "1x4.mainTask0.success_modal.text": "Váš prvý algoritmus v tejto úrovni umožnil hrdinovi rozsekať sudy stojace v ceste a otvoriť dvere pomocou páky.",
 "1x4.mainTask1.introduction_modal.text": "V tejto úlohe hrdinu čaká dlhšia cesta, ktorá obsahuje skákanie, zničenie krabice a obídenie pasce.",
 "1x4.mainTask1.success_modal.text": "Váš druhý algoritmus umožnil hrdinovi úspešne dosiahnuť cieľ a prekonať všetky prekážky.",
 "1x4.mainTask2.introduction_modal.text": "Cestu hrdinovi blokujú dve po sebe nasledujúce pasce, ktoré sa nedajú preskočiť. Našťastie páky na ich vypnutie sú nablízku, použite ich.",
 "1x4.mainTask2.success_modal.text": "Vo vašom treťom algoritme ste použili obe páky a tak hrdina úspešne prekonal nebezpečnú prekážku.",
 "1x4.mainTask3.introduction_modal.text": "A už nasleduje posledná úloha tejto úrovne, v ktorej opäť treba otvoriť dvere. Otvorte ich pákou nachádzajúcou sa za vázou.",
 "1x4.mainTask3.success_modal.text": "Dokázali ste, že používanie páky vám ide tak dobre, ako skákanie a sekanie mečom.",

 "1x5.welcome_modal.text":"V piatej úrovni hrdina získava novú schopnosť - otvorenie truhlice. Túto schopnosť bude potrebovať, aby mohol otvoriť dvere kľúčom, ktorý zoberie z truhlice. Okrem toho si precvičíte všetky doteraz získané schopnosti.",
 "1x5.finish_modal.text": "Úspešne ste sa naučili schopnosť otvárať truhlicu s hrdinom, ale aj pohyb, skákanie, útok mečom a použitie páky. Toto bola záverečná úroveň.",
 "1x5.mainTask0.introduction_modal.text": "Cestu k prvému kamennému tlačidlu blokuje voda, krabica, pasca a zatvorené padacie dvere. Prekonajte prekážky a otvorte dvere.",
 "1x5.mainTask0.success_modal.text": "Váš prvý algoritmus v tejto úrovni umožnil hrdinovi dostať sa do miestnosti s truhlicami.",
 "1x5.mainTask1.introduction_modal.text": "Aby sa hrdina dostal ďalej, musí z truhice získať kľúč na otvorenie zamknutých dverí. Použite blok otvorenia truhlice a potom priveďte hrdinu na kamenné tlačidlo pred dverami.",
 "1x5.mainTask1.success_modal.text": "Úspešne ste našli kľúč a otvorili dvere. Hrdina môže pokračovať ďalej v ceste.",
 "1x5.mainTask2.introduction_modal.text": "V tejto úlohe máme kamenné tlačidlo až za zatvorenými dverami, pred ktorými je aktivovaná pasca. Použite páky, aby ste sa dostali cez prekážky.",
 "1x5.mainTask2.success_modal.text": "Vo vašom treťom algoritme ste použili obe páky a tak hrdina úspešne prekonal nebezpečnú prekážku.",
 "1x5.mainTask3.introduction_modal.text": "Ku kamennému tlačidlu pre splnenie tejto úlohy vedie jedna cesta, avšak blokuje ho pasca, ktorej sa nedá vyhnúť. Vypnite ju pomocou páky.",
 "1x5.mainTask3.success_modal.text": "Dobrá práca, váš hrdina už má cieľ na dosah.",
 "1x5.mainTask4.introduction_modal.text": "V poslednej úlohe piatej úrovne použite páku na vypnutie pasce a preskočte zatopenú časť.",
 "1x5.mainTask4.success_modal.text": "Je zrejmé, že používanie páky pre odstránenie prekážok už zvládate dokonale.",

 "2x1.welcome_modal.text":"Začína sa druhá kategória hry a herný systém ovládania sa mení. Odteraz nebudete vyberať blok so správnym smerom alebo nastavovať smer napr. pri skákaní. Smer hrdinu už bude nastavený, zobrazený žltou šipkou na bloku. Na jeho zmenu musíte hrdinu otáčať pomocou dvoch blokov na to určených, predtým, ako hrdina vykonáva ostatné príkazy.",
 "2x1.finish_modal.text": "Úspešne ste sa naučili základy ovládania hrdinu podľa nových pravidiel.",
 "2x1.mainTask0.introduction_modal.text": "V prvej úlohe vám stačia bloky pohybu o jeden krok a otáčania. Na začiatku úrovne je hrdina nasmerovaný doprava, otočenie doľava ho nasmeruje hore, otočenie doprava ho nasmeruje dole. Správne ho otáčajte a preskákajte s ním až ku kamennému tlačidlu.",
 "2x1.mainTask0.success_modal.text": "Váš prvý algoritmus využíva nový systém ovládania a tým umožnil hrdinovi preskočiť na prvé kamenné tlačidlo.",
 "2x1.mainTask1.introduction_modal.text": "Teraz už je cieľ o niečo ďalej a v ceste už stojí viacero prekážok. Zničte sud a vyhnite sa pasciam, ale hlavne dávajte pozor, aby sa hrdina vždy otočil, keď je to potrebné.",
 "2x1.mainTask1.success_modal.text": "Úspešne ste sa vyhli všetkým prekážkam. Hrdina môže pokračovať ďalej v ceste.",
 "2x1.mainTask2.introduction_modal.text": "V tejto úlohe je treba použiť páku, aby sa zneškodnila aktivovaná pasca, ktorej sa nedá vyhnúť.",
 "2x1.mainTask2.success_modal.text": "Vo vašom treťom algoritme ste použili páku a hrdina tak mohol prekonať nebezpečnú prekážku.",
 "2x1.mainTask3.introduction_modal.text": "Ku kamennému tlačidlu pre splnenie tejto úlohy vedie komplikovanejšia cesta s vázami stojacimi v ceste, ktoré treba zničiť.",
 "2x1.mainTask3.success_modal.text": "Dobrá práca, váš hrdina má cieľ na dosah.",

 "2x2.welcome_modal.text":"V druhej úrovni druhej kategórie hrdina získavate nový blok - opakuj x-krát. Ide o cyklus typu for, ktorý vykoná všetky bloky, ktoré k nemu pripojíte, toľko krát, koľko nastavíte. Toto sa hodí, pokiaľ k splneniu úlohy stačí vykonať postupnosť nejakých blokov viac krát za sebou.",
 "2x2.finish_modal.text": "Úspešne ste sa naučili pracovať s cyklom typu for.",
 "2x2.mainTask0.introduction_modal.text": "V prvej úlohe vám stačia bloky pohybu o jeden krok a otáčania. Umiestnite ich do bloku opakuj x-krát a nastavte správne počet opakovaní. Na začiatku je hrdina nasmerovaný doprava.",
 "2x2.mainTask0.success_modal.text": "Vo vašom prvom algoritme ste správne použili a nastavili cyklus for a tým umožnili hrdinovi prejsť na prvé kamenné tlačidlo.",
 "2x2.mainTask1.introduction_modal.text": "Teraz hrdinu čaká skákanie cez vodu. To sa dá skvele optimalizovať pomocou bloku opakuj x-krát a na splnenie tejto úlohy je treba použiť dva také bloky. Začnite nasmerovaním hrdinu smerom hore, a potom použite bloky opakovania tak, že druhý bude vnútri prvého.",
 "2x2.mainTask1.success_modal.text": "Zvládli ste použiť vnorený cyklus for a hrdina môže pokračovať ďalej v ceste.",
 "2x2.mainTask2.introduction_modal.text": "V tejto úlohe máme kamenné tlačidlo až za zatvorenými dverami, ktoré sú zamknuté kľúčom, ktorý musíme nájsť v truhlici. Hrdina teda potrebuje otvoriť všetky truhlice. Použite blok opakuj x-krát, blok pohybu a otáčania doprava.",
 "2x2.mainTask2.success_modal.text": "Vo vašom treťom algoritme ste otvorili 6 truhlíc,  hrdina našiel kľúč a dostal sa cez zatvorené dvere.",
 "2x2.mainTask3.introduction_modal.text": "Cesta ku kamennému tlačidlu pre splnenie tejto úlohy je blokovaná vázami, ktoré treba zničiť. Opäť dva razy použite blok opakuj x-krát.",
 "2x2.mainTask3.success_modal.text": "Zdá sa, že optimalizovať algoritmy pomocou cyklu typu for vám nerobí žiaden problém. Ešte jedna úloha a ste v cieli.",
 "2x2.mainTask4.introduction_modal.text": "A na dokončenie úrovne stačí už len použiť dve páky, aby ste zneškodnili pasce blokujúce prístup do cieľa. Na začiatku nasmerujte hrdinu dole a dva razy použite blok opakuj x-krát.",
 "2x2.mainTask4.success_modal.text": "Dobrá práca, váš hrdina už má cieľ na dosah.",

 "2x3.welcome_modal.text":"V tretej úrovni získavate nový blok - opakuj pokiaľ nie je hrdina v cieli. Tento blok, ktorý je cyklom typu doWhile funguje podobne ako blok opakuj x-krát, až na to, že nemusíte nastavovať počet opakovaní. Všetky bloky v ňom sa teda budú postupne opakovať, až kým úloha nebude splnená alebo nedôjde k chybe pri plnení nejakého bloku.",
 "2x3.finish_modal.text": "Úspešne ste sa naučili používať blok opakuj pokiaľ nie je hrdina v cieli.",
 "2x3.mainTask0.introduction_modal.text": "Cestu k prvému kamennému tlačidlu je priama a bez žiadnych prekážok. Použite nový blok.",
 "2x3.mainTask0.success_modal.text": "Cyklus typu doWhile je jednoduchý a beží vynikajúco. Uvidíme, ako to pôjde na zložitejších úlohách.",
 "2x3.mainTask1.introduction_modal.text": "Aby sa hrdina dostal ďalej, musíte okrem nového bloku použiť aj blok opakuj x-krát, ktorý vložíte dovnútra.",
 "2x3.mainTask1.success_modal.text": "Úspešne ste skombinovali dva cykly. Hrdina môže pokračovať ďalej v ceste.",
 "2x3.mainTask2.introduction_modal.text": "V tejto úlohe sa ku kamennému tlačidlo hrdina dostane skokmi. Blok opakuj x-krát tu netreba použiť.",
 "2x3.mainTask2.success_modal.text": "Zdá sa, že vám používanie cyklu typu doWhile nerobí žiaden problém.",
 "2x3.mainTask3.introduction_modal.text": "Dostať sa ku ďalšiemu kamennému tlačidlu je tentokrát ťažšie, na jednom z blokov sa nachádza pasca. Vypnite ju pomocou páky. Opäť použite aj blok opakuj x-krát, ktorý vložíte dovnútra.",
 "2x3.mainTask3.success_modal.text": "Dobrá práca, váš hrdina už má cieľ na dosah.",
 "2x3.mainTask4.introduction_modal.text": "V poslednej úlohe tretej úrovne použite opäť oba cykly - pričom cyklus for sa bude nachádzať vnútri cyklu doWhile. Pred použítím cyklu doWhile hrdinu otočte raz doprava.",
 "2x3.mainTask4.success_modal.text": "Je zrejmé, že používanie oboch cyklov už zvládate dokonale.",

 "2x4.welcome_modal.text":"Vo štvrtej úrovni získavate až dva nové bloky - blok ak v smere nasleduje a blok ak v smere na dlaždici je. Tieto bloky fungujú ako podmienka if, teda iné bloky vložené do nich sa vykonajú len vtedy, ak zadaná podmienka je splnená. Toto nám umožňuje vykonávať rozličné príkazy podľa toho, kde sa hrdina práve nachádza.",
 "2x4.finish_modal.text": "Úspešne ste sa naučili používať podmienky if. Nasleduje záverečná úroveň hry.",
 "2x4.mainTask0.introduction_modal.text": "Cestu k prvému kamennému tlačidlu neblokujú žiadne prekážky, avšak hrdina sa musí otočiť vždy na správnom mieste. Použite blok opakuj pokiaľ nie je hrdina v cieli a dvakrát blok ak v smere nasleduje.",
 "2x4.mainTask0.success_modal.text": "Váš prvý algoritmus s podmienkou fungoval výborne a hrdina dorazil na kamenné tlačidlo.",
 "2x4.mainTask1.introduction_modal.text": "Aby sa hrdina dostal ďalej, musí použiť každú páku v ceste na zneškodnenie pascí a otvorenie padacích dverí. Použite blok opakuj pokiaľ nie je hrdina v cieli, blok ak v smere nasleduje a blok ak v smere na dlaždici je.",
 "2x4.mainTask1.success_modal.text": "Úspešne ste zneškodnili pasce a otvorili dvere. Hrdina môže pokračovať ďalej v ceste.",
 "2x4.mainTask2.introduction_modal.text": "V tejto úlohe hrdinovi v ceste stoja vázy, ktoré je treba zničiť a zároveň treba hrdinovi zmeniť smer, keď je pred ním voda alebo stena. Na začiatku hrdinu otočte raz doprava a potom použite blok opakuj pokiaľ nie je hrdina v cieli, blok ak v smere nasleduje a blok ak v smere na dlaždici je.",
 "2x4.mainTask2.success_modal.text": "Vo vašom treťom algoritme ste využili obe podmienky presne tak, ako bolo zadané.",
 "2x4.mainTask3.introduction_modal.text": "Ku kamennému tlačidlu pre dokončenie tejto úrovne vedie celkom krátka cesta, avšak sú na nej pasce a vodná plocha, ktoré treba preskočiť. Najprv nasmerujte hrdinu smerom doprava a potom použite blok opakuj pokiaľ nie je hrdina v cieli, blok ak v smere nasleduje a blok ak v smere na dlaždici je.",
 "2x4.mainTask3.success_modal.text": "Dobrá práca, váš hrdina sa dostal do cieľa.",

 "2x5.welcome_modal.text":"V piatej úrovni už nebude pridaný ďaľší blok - avšak si zopakujeme, čo bolo hlavnou témou druhej kategórie a teda práca s cyklami a podmienkami.",
 "2x5.finish_modal.text": "Gratulujeme! Úspešne ste sa naučili základy tvorby algoritmov pomocou Google Blockly.",
 "2x5.mainTask0.introduction_modal.text": "Ku kamennému tlačidlu sa hrdina musí dostať cez vodu a zničiť sud. Použite len blok opakuj pokiaľ nie je hrdina v cieli a vyriešte úlohu bez použitia podmienok.",
 "2x5.mainTask0.success_modal.text": "Zdá sa, že používať cyklus doWhile vám naozaj ide dobre.",
 "2x5.mainTask1.introduction_modal.text": "Aby sa hrdina dostal ďalej, musí otvoriť všetky truhlice aby našiel kľúč od dverí a zároveň použiť všetky páky, aby zneškodnil pasce v ceste. Použite blok opakuj pokiaľ nie je hrdina v cieli, v ktorom bude dvakrát blok ak v smere nasleduje a za ním blok opakuj x-krát, ktorý bude obsahovať podmienku pre truhlicu a podmienku pre páku.",
 "2x5.mainTask1.success_modal.text": "Váš algoritmus umonžil hrdinovi prehľadať všetky truhlice, použiť páky na deaktivovanie pasce a dostať sa cez dvere. Hrdina môže pokračovať ďalej v ceste.",
 "2x5.mainTask2.introduction_modal.text": "V tejto úlohe máme kamenné tlačidlo trochu ďalej a na ceste sú pasce, ktoré treba preskočiť. Na začiatku otočte hrdinu raz doľava a potom použite blok opakuj pokiaľ nie je hrdina v cieli, dvakrát blok ak v smere nasleduje a raz blok ak v smere na dlaždici je.",
 "2x5.mainTask2.success_modal.text": "Vo vašom treťom algoritme ste použili obe podmienky a tak hrdina úspešne dorazil na kamenné tlačidlo.",
 "2x5.mainTask3.introduction_modal.text": "A na záver, hrdina potrebuje zničiť vázy a použiť páku na otvorenie padacích dverí, aby mohol prísť na posledné kamenné tlačidlo v tejto hre. Použite blok opakuj pokiaľ nie je hrdina v cieli, jeden krát blok ak v smere nasleduje a dvakrát blok ak v smere na dlaždici je.",
 "2x5.mainTask3.success_modal.text": "Posledná úloha v hre bola práve splnená.",

 "footer.heading.links": "Odkazy",
 "footer.heading.latest.updates": "Najnovšie aktualizácie",
 "footer.heading.technologies": "Technológie",

 "footer.links.0": "GitHub Repozitár",
 "footer.links.1": "PlayCanvas",
 "footer.links.2": "Google Blockly",
 "footer.links.3": "Hostované na Microsoft Azure",

 "footer.latestupdates.0.title": "Azure vydanie - opravy",
 "footer.latestupdates.0.date": "15.5.2020",
 "footer.latestupdates.0.text": "Registrácia vyžaduje Google ReCaptcha a používa sa protokol HTTPS, opravená je funkčnosť Zapamätať prihlásenie. Bol pridaný nový scroll bar a footer má nový dizajn.",

 "footer.latestupdates.1.title": "Azure vydanie",
 "footer.latestupdates.1.date": "14.5.2020",
 "footer.latestupdates.1.text": "Blockly Hra je od dnes hostovaná na Microsoft Azure.",

 "footer.latestupdates.2.title": "Lokalizácia",
 "footer.latestupdates.2.date": "13.5.2020",
 "footer.latestupdates.2.text": "Blockly Hra používa IP-API na určenie kódu krajiny používateľa a podľa toho nastavuje jazyk."
}